; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Jared Breland <jbreland@legroom.net>
; Homepage:	http://www.legroom.net/mysoft
;
; Translation: José Gonçalves <joseaagoncalves@gmail.com>
; Homepage: http://eufisica.no.sapo.pt
;		
;		Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Cancelar"
MAIN_DEST_DIR_LABEL = "&Directório de destino:"
MAIN_FILE_LABEL = "&Ficheiro/Instalador a extrair:"
MENU_FILE_LABEL = "&Ficheiro"
MENU_FILE_QUIT_LABEL = "&sair"
MENU_EDIT_LABEL = "&Editar"
MENU_EDIT_PREFS_LABEL = "&Preferências"
MENU_HELP_LABEL = "&Ajuda"
MENU_HELP_WEB_LABEL = "%s &Página Oficial"
PREFS_TITLE_LABEL = "Preferências"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opções do Universal Extractor"
PREFS_HISTORY_LABEL = "Manter &histórico dos ficheiros"
PREFS_FORMAT_OPTS_LABEL = "Opções de Formatação-Especificidades"
PREFS_LANG_LABEL = "&Idioma"
PREFS_DEBUG_LABEL = "Directoria do ficheiro de &Relatório:"
PREFS_WARN_EXECUTE_LABEL = "&Avisar antes de executar ficheiros"
PREFS_REMOVE_DUPE_LABEL = "&Remover ficheiros duplicados"
PREFS_REMOVE_TEMP_LABEL = "Remover ficheiros &temporários"
PREFS_APPEND_EXT_LABEL = "I&ndexar extensões ficheiros em falta"
METHOD_ADMIN_RADIO = "%s Instalador Administrativo"
METHOD_EXTRACTION_RADIO = "%s extracção"
METHOD_HEADER = "%s Extracção"
METHOD_MSI_NOTE_LABEL = "Nota:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml requer o"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Método de Extracção"
METHOD_SWITCH_RADIO = "%s trocar"
METHOD_NOTIS_RADIO = "Não é um instalador InstallShield"
METHOD_TEXT_LABEL = "%s suporta os seguintes métodos para a extracção %s pacotes.  Infelizmente, nenhum destes métodos são 100% fiáveis.  Se o método por defeito não funcionar, porfavor reinicie  %s e seleccione um método alternativo."
METHOD_UNPACKER_RADIO = "%s Desempacotar"

; GUI control functions
DOES_NOT_EXIST = "não existe.%n"
EXTRACT_TO = "Extrair para"
INVALID_DIR_SELECTED =  "%s não é uma directoria válida."
INVALID_FILE_SELECTED = "%sPor favor seleccione um ficheiro válido."
OPEN_FILE = "Abrir ficheiro"
SELECT_FILE = "Seleccionar ficheiro"
WRITE_TO = "Escrever para"

; Common terms
TERM_ARCHIVE = "Arquivo"
TERM_COMPRESSED = "ficheiro comprimido"
TERM_DISK = "disco"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "ficheiro codificado"
TERM_EXECUTABLE = "executável"
TERM_FAILED = "falhou"
TERM_HELP = "Ficheiro de Ajuda"
TERM_HOTFIX = "hotfix"
TERM_IMAGE = "imagem"
TERM_INSTALLER = "instalador"
TERM_PACKAGE = "Pacote"
TERM_PATCH = "patch"
TERM_SFX = "Auto-Extracção"
TERM_STAGE = "Stágio"
TERM_SUCCEEDED = "sucedido"
TERM_TESTING = "Testando"
TERM_UNKNOWN = "desconhecido"
TERM_UNPACKED = "descompactado"
TERM_UPDATER = "actualizador"

; Status messages
SCANNING_FILE = "Pesquisando o ficheiro para determinar o tipo de ficheiro."
SCANNING_EXE = "Pesquisando o ficheiro com %s pesquisador."
EXTRACTING = "Extraíndo os ficheiros a partir de:"
INIT_WAIT = "Esperar pela inicialização do instalador.%nPor favor espere."

; Custom prompts
CONVERT_CDROM = "%s Imagens de CD-ROM não podem ser extraídas directamente.  Contudo, esta imagem%nserá convertida numa imagem ISO de CD-ROM, que será extraível.%n%nDeseja continuar?%nNota: Este processo demorará alguns minutos."
CONVERT_CDROM_STAGE1_FAILED = "Erro:  A imagem de CD-Rom não pode ser convertida.%nSe é uma imagem BIN/CUE, certifique-se que o ficheiro CUE está devidamente formatado."
CONVERT_CDROM_STAGE2_FAILED = "Erro:  Uma imagem ISO foi criada a partir da imagem %s, mas não poderá ser convertida.%nDeseja manter a imagem ISO para uma posterior análise detalhada?"
CONVERT_BIN_MISSING = "Erro: Não pode ser encontrado:%n%s\%s.%s%n%nAmbos %s.bin e %s.cue são necessários."
INIT_COMPLETE = "Inicialização %s.  Por favor sair do instalador, depois clique OK para continuar."
WISE_MSI_PROMPT = "Nota:  Este método somente funciona com pacotes específicos do Wise for Windows Installer.%nSe o Wise Installation Wizard iniciar e simplesmente esperar por input, o ficheiro não %né suportado.  Por favor saia do instalador, e %s abortar extracção.%n%nDeseja continuar?"
UNPACK_PROMPT = "Este ficheiro está empacotado com compressão %s , mas poderá ser extraível.%nIsto poderá ser por causa do tipo de ficheiro não ser suportado, ou porque%nsimplesmente não estão incluídos ficheiros para extrair.%n%nDeseja desempacotar na mesmam o ficheiro?%n%nNota: O ficheiro desempacotado será chamado:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Erro: %s%nnão poderá ser desempacotado."
WARN_EXECUTE = "Aviso:  De modo a extrair ficheiros deste tipo, the file must be directly executed.%nIf you continue, the following command will be run:%n%n%s%n%nIf you believe this file may possibly be malicious, it is recommended that you do not continue.%nDo you want to continue with extraction?"

; Help text
HELP_SUMMARY = "Extrair ficheiros a partir de qualquer tipo de arquivo ou pacote de instalação."
HELP_SYNTAX = "%nUsado:  %s [/ajuda] [nome do ficheiro [destino]]"
HELP_ARGUMENTS = "%n%nArgumentos Suportados:"
HELP_HELP = "%n     /ajuda%t%tMostrar esta informação de ajuda"
HELP_FILENAME = "%n     nome de ficheiro%tNome do ficheiro a extrair"
HELP_DESTINATION = "%n     destino%tDirectório no qual se irá extrair"
HELP_SUB = "%n%nPassando /sub em vez do nome da directoria de destino indicar%n%s para extrair na nomeada subdirectoria depois do arquivo."
HELP_EXAMPLE1 = "%n%nExemplo:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nCorrendo %s sem qualquer argumento será%navisado o utilizador pelo nome do ficheiro e directoria de destino."

; Error messages
CANNOT_LOG = "%s extracções não podem ser logged."
CANNOT_DEBUG = "O directório de destino, "%s", do ficheiro de relatório não é de escrita.%nA sua pasta temporária será utilizada."
CANNOT_EXTRACT = "%s não pode ser extraído.%nTipo de ficheiro devolvido foi: %s%n%nClique OK se deseja analizar o ficheiro, ou Cancel para sair."
UNKNOWN_EXT = "%s%ntem uma extensão desconhecida e não pode ser extraída."
INVALID_DIR = "%s%nnão pode ser criada.  Por favor seleccione um destino válido."
EXTRACT_FAILED = "%s não pode ser extraída.%nParece ser um %s, que é suportado, mas a extracção falhou.%nPor favor ver o log file, %s, para mais informação.%n%nClique OK para ver o log file agora, ou Cancel para sair."

[Installer]
; Components page
COMP_DOCS = "Documentação e informação da licença"
COMP_LANG = "Ficheiros de Idiomas para suporte de internacionalização"
COMP_ACE = "Suporte para ficheiros ACE"
COMP_KGB = "Suporte para ficheiros KGB"
COMP_PEA = "Suporte para ficheiros Pea"
COMP_SIT = "Suporte para ficheiros StuffIt"

; Preferences page
PREFS_CAPTION = "Ajustar Opções do Programa"
PREFS_DESCRIPTION = "Quais as opções de Universal Extractor gostaria de ajustar?"
PREFS_LABEL1 = "Deve de seleccionar nas seguintes opções de modo a ajustar o comportamento do Universal Extractor."
PREFS_LABEL2 = "Estas opções podem ser modificadas depois da instalação modificando o UniExtract.ini."
LANGUAGE_LABEL = "Idioma por defeito"
DEBUG_LABEL = "Localização do Ficheiro Debug"
APPEND_EXT_LABEL = "&Adicionar extensões de ficheiro em falta"
HISTORY_LABEL = "&Manutenção do arquivo de histórico"
REMOVE_DUPE_LABEL = "Remover ficheiros &duplicados"
REMOVE_TEMP_LABEL = "Remover ficheiros &temporários"
WARN_EXECUTE_LABEL = "&Avisar antes de executar os ficheiros"

; Tasks page
ASSOCIATE = "&Ligar integração no menu de contexto no Explorer"
ASSOCIATE_FILES = "Adicionar UniExtract &Ficheiros... no menu de contexto"
ASSOCIATE_HERE = "Adicionar UniExtract &Aqui no menu de contexto"
ASSOCIATE_SUBDIR = "Adicionar UniExtract para &Subdir no menu de contexto"
ASSOCIATE_FORCE = "Forçar &associação com todos os formatos de arquivo suportados"
MODIFY_PATH = "Adicionar Universal Extractor para seu atalho de &system"
DESKTOP_ICON = "Criar ícone no Ambiente de &Trabalho"
QUICK_LAUNCH_ICON = "Criar ícone na Barra de Iniciação &Rápida"
SENDTO_ICON = "Criar ícone em Enviar&Para"

; Context Menu integration
EXTRACT_FILES = "UniExtract &Ficheiros..."
EXTRACT_HERE = "UniExtract &Aqui"
EXTRACT_SUB = "UniExtract para &Subdirectoria"
